export const schoolList = [{
    name: '聖公會油塘基顯小學',
    programs: ['小賣部只有重用餐具', '午膳供應商只有重用餐具'],
  },
  {
    name: '九龍灣聖若翰天主教小學',
    programs: [
      '小賣部只有重用餐具',
      '午膳供應商只有重用餐具',
      '沒有設置自動售賣機',
    ],
  },
  {
    name: '聖安當小學',
    programs: ['小賣部只有重用餐具', '午膳供應商只有重用餐具'],
  },
  {
    name: '九龍婦女福利會李炳紀念學校',
    programs: [
      '小賣部只有重用餐具',
      '午膳供應商只有重用餐具',
      '沒有設置自動售賣機',
    ],
  },
  {
    name: '聖公會林護紀念中學',
    programs: ['小賣部只有重用餐具', '午膳供應商只有重用餐具'],
  },
  {
    name: '聖公會聖西門呂明才中學',
    programs: ['小賣部只有重用餐具', '午膳供應商只有重用餐具'],
  },
  {
    name: '保良局陳守仁小學',
    programs: [
      '小賣部不主動提供即棄塑膠',
      '午膳供應商只有重用餐具',
      '午膳供應商不主動提供即棄塑膠',
    ],
  },
  {
    name: '浸信會天虹小學',
    programs: [
      '小賣部不主動提供即棄塑膠',
      '午膳供應商只有重用餐具',
      '沒有設置自動售賣機',
    ],
  },
  {
    name: '嗇色園主辦可藝中學',
    programs: ['小賣部不主動提供即棄塑膠', '午膳供應商只有重用餐具'],
  },
  {
    name: '世界龍岡學校劉皇發中學',
    programs: ['小賣部不主動提供即棄塑膠', '午膳供應商只有重用餐具'],
  },
  {
    name: '玫瑰崗中學',
    programs: ['小賣部不主動提供即棄塑膠', '午膳供應商只有重用餐具'],
  },
  {
    name: 'The Chinese Foundation Secondary School',
    programs: [
      '小賣部不主動提供即棄塑膠',
      '午膳供應商只有重用餐具',
      '午膳供應商不主動提供即棄塑膠',
    ],
  },
  {
    name: 'Maryknoll Convent School (Secondary Section)',
    programs: ['午膳供應商只有重用餐具', '午膳供應商不主動提供即棄塑膠'],
  },
  {
    name: 'C.U.H.K.F.A.A. Chan Chun Ha Secondary School',
    programs: ['午膳供應商只有重用餐具', '午膳供應商不主動提供即棄塑膠'],
  },
  {
    name: '樂善堂楊葛小琳中學',
    programs: ['午膳供應商不主動提供即棄塑膠'],
  },
  {
    name: '東華三院李潤田紀念中學',
    programs: [
      '午膳供應商不主動提供即棄塑膠',
      '有設置自動售賣機，但沒有售賣樽裝飲品',
    ],
  },
  {
    name: '五旬節聖潔會永光書院',
    programs: ['午膳供應商不主動提供即棄塑膠'],
  },
];

export const programList = [
  '所有有份參與走塑校園',
  '小賣部只有重用餐具',
  '小賣部不主動提供即棄塑膠',
  '午膳供應商只有重用餐具',
  '午膳供應商不主動提供即棄塑膠',
  '沒有設置自動售賣機',
  '有設置自動售賣機，但沒有售賣樽裝飲品',
];

export const stories = [{
    id: 0,
    title: "走塑也是一種生活選擇",
    desc: "很多人覺得走塑是一件困難的事，也會造成生活上的不便，又或者不懂從何做起。其實，走塑是一種生活習慣和細節上的選擇。今次我們來到這間小店，就見証了何謂「選擇」。",
    entityName: "Pattern",
    result: "",
    class: "column-one",
    image: "https://api.greenpeace.org.hk/2018/oceans/images/pattern_square.jpg",
    content: "這間位於大埔的小店Pattern，餐桌上同時放了膠飲管和不鏽鋼飲管讓食客自行選擇。如果你是食客，你會如何選擇？當你選擇使用不鏽鋼飲管時，其實已對「走塑」投下一票。小店實行這個措施有兩個多月了，出乎意料的是，不少食客反而直接「裸飲」！店主Bobo認為「其實有時把選擇權放在食客面前，反而是一種提醒，倒不如兩者都不用啦！」也對, 「裸飲」其實也不是出奇的事，我們平時喝水時不也是捧杯就喝，名符其實的「裸飲」嗎？\n\n <img src='https://api.greenpeace.org.hk/2018/oceans/images/pattern_pic1.jpg'> \n\n除了塑膠飲管，小店並沒有其他即棄塑膠餐具。店主知道要「一刀切」改變並非一朝一夕的事，倒不如加入不鏽鋼飲管給食客選擇吧！當然，使用不鏽鋼飲管會衍生成本增加的問題，但另一種壓力來源反而是來自身邊人的質疑：「冇人會用咖！」面對質疑，其實也是一種推動力。店主Bobo笑指，「沒有試過又怎知道不行呢！員工對於新措施都覺得OK呀！因為大家一開始就覺得沒有人會用，哈哈！」後來越來越多食客使用不鏽鋼飲管時，洗碗姐姐都沒有怨言，還一起研究怎樣才洗得乾淨呢！\n\n至於外賣，，起初小店先實行自備外賣餐盒即享折扣，可惜當時反應不理想。後來店主推行客人可自備餐盤訂購到會，甚至提供一站式到會服務，包括預備食物至租借爐具。「試過有公司訂購到會，真的可以做到一件塑膠垃圾也沒有！」得到正面的回響，更令店主確信走塑之路，對內對外都是是可行的。\n\n小店的門外貼著「自備外賣盒」、「撲水」、「歡迎導盲犬」等貼紙，踏進店內是一片醒神溫暖的黃色牆身，頓時感受到店主Bobo對社會的一份關懷。「做飲食業其實有很多浪費的地方，不想自己成為浪費的一份子，希望由源頭減廢做起。」所以小店沒有遇到什麼團體邀請，就自發性地踏上「走塑」之路，實屬難得。\n\n好多人都以為走塑是個新潮流，只是適合年青人參與。其實不然。「不關乎年齡和教育程度，只是視乎你有沒有心。」一間小店可以做到的也許很微小，但店主靠的正是這一顆心，一種態度，一步一步去做，感染更多人「走塑」。\n\n小店現時已經拼棄即棄膠餐具，即使塑膠飲管的入貨量也大大減少。其實每個人都有能力去解決塑膠問題。一間食店可以改變一批食客的習慣，如果香港有更多食店願意走塑，匯集的力量就會更加強大！這間小店已經加入「走塑食堂」行列，鋪面張貼了「全城走塑」的貼紙記認。如果你是餐廳負責人，你已經實行走塑嗎？或者你對走塑計劃有興趣嗎？歡迎登入以下網址，加入成為「走塑食堂」！"
  },
  {
    id: 1,
    title: "走塑CAFE的非環保自白",
    desc: "你以為走塑的咖啡店一定是環保人士的把戲嗎？一副好爸爸樣子的店主Birdie，也直截了當的表示，自己並不是環保人士。",
    entityName: "Birdie",
    result: "兩年來共走50,000枝即棄塑膠飲管！",
    class: "column-one",
    image: "https://api.greenpeace.org.hk/2018/oceans/images/hershey_square.jpg",
    content: "「我絕對不是環保人士。」\n\n你以為走塑的咖啡店一定是環保人士的把戲嗎？一副好爸爸樣子的店主Birdie，也直截了當的表示，自己並不是環保人士。\n\n已有四個小孩的Birdie，每天的例行公事就是去街市買餸。「剛才考慮不如順便買雞蛋，但想起家裡仍有，不需要的話還是先不買。」猶如走塑這回事，他認為是個人一念之間的選擇，有些東西不是必要的 ，就可以選擇不用。誰也明白環保是好事，不過是否付諸實行則是一個進程，而他自己則量力而為。兩年前，Birdie的咖啡店開始棄用塑膠飲管，轉用紙飲管。後來發現有不鏽鋼及玻璃飲筒，就改用這些可重用的飲管，徹底改變即棄文化，「紙飲筒雖然比塑膠好，但浸在飲品中容易變軟，又即用即棄。可以的話，我希望店內都使用可重用物品。」\n\n為甚麼不是「環保人士」，卻忽然減塑呢？「首次在外國見到餐廳減塑，覺得理念幾好，值得一試。而我的衡量很實際—打過算盤，省下不斷購買即棄飲筒的錢，扣除一開始的添置成本，兩年以來，轉用可重用飲管反而多賺了一點點。」雖然是很小的數目，Birdie也證明減塑與生意不一定對立。而且，這也為他吸引了意外客源。原本只在店內使用不鏽鋼飲管，後來有客人覺得有趣，繼而開始零售。「不知是否韓國傳統筷子的關係，對不鏽鋼有親切感，很多韓國人專程過來購買。」\n\n沒有客人投訴嗎？員工沒有抱怨麻煩嗎？「我的小孩每天都用不鏽鋼飲管，所以我不見得有衛生問題。而且清洗時也是在洗碗機之外多刷幾下，與一般清洗步驟無異。」不過Birdie坦言減塑仍有很多限制及挑戰：「外賣暫時很難處理。或許大型連鎖咖啡店可以參考外國做法，售賣可重用的外賣杯，客人在A分店買後，可在B分店還杯。而且省下的紙杯、杯蓋及隔熱墊，足以提供數元的自攜杯優惠。這對公司、客人及環境，都是實際又有利的方案。」\n\n對於無塑香港的想像，Birdie期待政府可多行一步。在政策上更加積極進取，推動社會的走塑氛圍。而目前來說，「不是最環保也好，做到幾多就做幾多啦！」"
  },
  {
    id: 2,
    title: "從藝術空間到走塑餐廳",
    desc: "餐廳店主阿四，認為有心細味食物，考究食材來源的話，其實與關注環境密不可分。所以從吃得嘴刁到走塑，其實相距不遠。",
    entityName: "阿四",
    result: "一年來共走1,000枝即棄塑膠飲管！",
    class: "column-one",
    image: "https://api.greenpeace.org.hk/2018/oceans/images/%E4%BA%86_square.jpg",
    content: "「吃東西、農業、環境、社會...等等，都是一套套互相扣連的概念，值得我們去尋根究底。所以食物是一個切入點，我們希望為來這裡的人，帶來連貫的生活體驗。」所以吃喝連結到走塑，也是理所當然。環保不只是空洞的口號，他認為要做就要徹底。這裡的堂食全走塑，因為未能解決外賣太多即棄的障礙，索性謝絕外賣單。\n\n阿四認為小店在走塑方面能做的，是一個尋找「最大公因數」的嘗試-撞板-再嘗試的過程。一些措施未必能即時為人所接受，「雖然轉用玻璃飲管的反應正面，但不少客人抗拒其他如不主動提供餐紙巾的措施，所以至今我們仍在一起尋找更好的取代方法。」不過，要以溝通和耐性找出客人能接受的界線之餘，他亦認為不過份遷就很重要。「如果客人離開後，能激起他們反思為甚麼一定要用餐紙抹嘴，我就滿足了。」阿四補充。\n\n「我自己生活算不上特別環保，都拜伙伴影響所賜。」這也回到阿四經常提到的連結，是人與人之間的連結，也關連到整個社區。他的灣仔社區伙伴，稍後將會進駐了了樓上，售賣無即棄包裝雜貨。而了了亦因此在店中設立共享環保袋角落，供有必要的人放下也拿走。所以，這也是打破框架後，餐廳、咖啡店、商舖、甚至與朋友閒談，都可以成為實踐走塑的機會。"
  },
  {
    id: 3,
    title: "校園前線走塑份子",
    desc: "Yanbo沒有擔任任何正式職位，卻熱衷於在學校推行走塑，包括協助宣傳「八大走飲管」。",
    entityName: "Yanbo",
    class: "column-one",
    image: "https://api.greenpeace.org.hk/2018/oceans/images/yanbo_square.jpg",
    content: "Yanbo即將在香港教育大學升讀大四，說起在校內舉行過的自發活動時如數家珍，包括她在近期協助宣傳的「八大走飲管」計劃。「第一步當然是飯堂願意執行走塑措施，但要真正落地，獲取師生認同及配合，意識同樣重要。」經過觀察，她發覺飯堂內的當眼處，有一幅空白的牆，就立刻跑去找飯堂經理，商討在那裡放置相關的宣傳品，最後決定收集使用過的飲管，砌出教大每星期丟棄10,000枝飲管的數字。\n\n「收集飲管也是另一個故事，由於飯堂員工最初未必明白是甚麼一回事，嫌留起飲管麻煩。幸好經過溝通，他們也願意配合。」雖然收集、清洗、設計等功夫不少，但收到師生反映因為這幅告示而主動不用飲管，就是最大的鼓舞。「飯堂經理還主動聯絡，表示尚有其他空位等我們『搞搞佢』。當然我也同時追問學校同事，會否要求餐廳淘汰飲管以外的即棄用品？校方表示是可行，也正在考慮！下一步要找時間詳談。」\n\nYanbo 看似是「搞事份子」，可是她的推動力，只是源自根本的信念，不受任何身份限制。「我家本來一點也算不上環保。轉捩點發生在初中，我偶然讀到陳曉蕾所著的《剩食》，裡面描述的浪費，徹底顛覆了我對資源運用的價值觀。我開始重新審視日常生活習慣，反思垃圾與資源，想要或需要的界線，希望減輕自己為地球帶來的負擔。」\n\n帶著三分腼腆的Yanbo，在最初一頭栽進「環保」的日子，曾經因此與家人磨擦。「當時非常渴望他們接受我這一套，就直接指出『錯處』，要求他們改變。」不難想像，換來的只有反感和更遠的距離。自此，Yanbo轉行「和理非非路線」，相信做好自己本份，定能感染身邊的圈子。的確，她眉飛色舞地跟筆者分享一段自拍影片，是同學主動要求Yanbo陪他去飯堂自攜容器買外賣。「那是他的第一次，擔心被拒絕，又害怕失敗的困窘。我在鼓勵他之餘，也忍不住拍下他的掙扎。最後當然是大成功啦！」\n\n說起未來大計，Yanbo有點困擾。「時間太少，想做的太多了。」臨近學期末，她希望借鏡其他大專所辦的退宿物資回收，於教大推行。但這得要校方提供行政及物流上的支援，「所以那天我想到就立刻打電話給校方，他們也爽快答應。」如此的行動力，相信她也沒太多需要顧慮，「我希望減塑以至反思資源的議題，能發酵成校内普遍的風氣，不只全靠特定的活躍份子，畢業後就無以為繼，所以很希望在來年能吸引到新的戰友。」"
  },
  {
    id: 4,
    title: "由下而上的佛系走塑",
    desc: "Barry自言是普通不過的朝九晚五打工仔，卻樂此不疲推動由下而上的改變，積極推廣減塑行動。",
    entityName: "Barry",
    result: "",
    class: "column-one",
    image: "https://api.greenpeace.org.hk/2018/oceans/images/barry_square.jpg",
    content: "Barry脹鼓鼓的背囊，除了收納一系列「走塑法寶」等自攜容器，還有一大袋發泡膠生果網。「之後要到柴灣的「不是垃圾站」幫忙，所以順便帶這些過去。」一般的不是垃圾站都由當區行動者組織，家住九龍的Barry似乎沒有在意地區之分。十年前，他已在大大小小的自發綠色組織團體當核心成員，至今仍然活躍於不同群組，例如先於政府關注大型活動減廢的「毋忘垃圾」。\n\n網上不時出現不少批評環保人士，如「咁環保唔好搭咁遠車」、「環保唔好買有生果網嘅生果」、「環保辦公室唔好裝冷氣」等，Barry倒是認同。「那說得對呀。其實說甚麼環保，我們即使搭乘公共交通工具，同樣在耗費地球資源，所以我們只是儘所能減輕影響，在不同選擇之間取捨。」斷捨離成為最近興起的概念，並不是提倡返回原始生活，只是保留最少，卻對自己最好的必需品。Barry認為與佛系說法「貪、嗔、痴」如出一轍，亦是所謂環保或減塑生活的出發點--不是當野人，只是藉由過乾淨俐落的生活，不倚賴多餘物件依然過得富足。\n\nBarry自言是普通不過的朝九晚五打工仔，卻樂此不疲推動由下而上的改變。從事銀行業的他，對推廣減塑積極行動，對減廢意識卻沒有訂立跑數目標。「這是一個很長時間而且緩慢的進程，但回看仍有造成改變。看看現在的減塑減廢社區組織遍地開花，甚至能推動政府部門作出些少改善，例如在年宵設立回收角。這些都是數年前無法想像的事。」自發民間組織的靈活機動，正好與傳統環團互相補位。而在外的活躍走塑份子，當然不會錯過感染身邊人的機會。「沒有說教，但我會以行動取代。例如我會自動自覺多帶太太那份自攜餐具，當然也少不了回家後的洗碗工作。」\n\nBarry回想當初越來越投入環境相關的自發工作，全因參加活動而認識了一班志同道合戰友，並肩而行。現時他也希望能夠繼續營造這些當年改變了他的契機，編織人與人之間的連結，壯大由下而上的走塑減廢聲勢，繼續邁往無塑香港。"
  },
];

import animateScroll from 'scrollto-with-animation'

export const scrollTo = (pos, duration = 600, delay = 0) => new Promise(resolve => {
  setTimeout(() => {
    animateScroll(document.documentElement, 'scrollTop', pos, duration, 'easeInOutSine', resolve)
  }, delay)
})

export const kebabify = (words) =>
  words
  .toLowerCase()
  .replace(' ', '-')

export const prettyDate = (date) =>
  new Date(date)
  .toString()
  .split(' ')
  .slice(0, 4)
  .join(' ')
  .replace(/( \d+)$/, ',$1')